
<?php
/*$example=33; //Переменной задается значение
    echo $example; //Вывод
    echo "</br>";//Перевод на новую строку
 if (is_integer($example))//Возвращает TRUE, если var является integer, FALSE - в ином случае.
    echo "yes";// Выводит yes
    echo "</br>";//Перевод на новую строку
 if (isset($example))//Возвращает TRUE, если var существует; иначе FALSE.
    echo "yes";// Вывод yes
    echo "</br>";//Пробел
 if (is_double($example))//Возвращает TRUE, если переданное число является дробным, то есть содержит символ точки '.', которая отделяет целую часть от дробной.
    echo "yes";//Вывод yes
    echo "</br>";//Пробел
$taptap="тест";//Задается значение переменной
    echo $taptap;//Вывод
    echo "</br>";//Пробел
 if (isset($taptap)) { //Возвращает TRUE, если var существует; иначе FALSE.
    echo "yes";//Выводит yes
    }
    else  {
       echo "</br>";//Пробел
       echo "no";//Выводит No
       }
       echo "</br>";//Пробел
$MyArray=array( //Массив
         1 => "a", //ключ + значение
         2 => "b",//ключ + значение
         3 => "c",//ключ + значение
         4 => "d",//ключ + значение
	);
echo "<pre>";//Элемент <pre> определяет блок предварительно форматированного текста.
print_r($MyArray); //print_r - печатает читабельную информацию о переменной.
       echo "</br>";//Пробел
var_dump($MyArray);//Эта функция возвращает структурированную информацию об одном или более выражений, которая включает его тип и значение.Массивы обрабатываются рекурсивно со значениями, предназначенными для показа структуры.
       echo "</br>";//Пробел
var_export($MyArray);//Эта функция возвращает структурированную информацию о переменной, переданной ей. Аналогична var_dump() за исключением того, что возвращённое представление является правильным РНР-кода.
       echo "</br>";//Пробел
       echo "</pre>";//Элемент <pre> определяет блок предварительно форматированного текста.

define("PI","3,14",true);//Определяет именованную константу. Внутри значения.
	echo PI;//Выводит первое значение.
		echo "</br>";//Пробел
 
$sdf="Пример";//Задаем значение переменной
	unset ($sdf);//unset() разрушает специфицированные переменные.
		echo sdf;//Вывод
echo "</br>";//Пробел

$sdfs="Пример";//Задаем значение переменной
	$random=43;//Переменной задается значение
	$result=$sdfs.$random;//Применяем новую переменную, и присваиваем первой переменной
	echo $result;//Вывод
echo "</br>";//Пробел*/


echo "\xE4\xEC\xE8\xF2\xF0\xE8\xE9";
echo "</br>";

$one=" ";
$two=0;
if($one===$two)
	echo"Они равны";
else
	echo "Они не равны";
echo "</br>";

$one=" ";
$two=0;
if($one==$two)
	echo"Они равны";
else
	echo "Они не равны";


?> 